## Import the libraries

In [1]:
import pymongo
from pymongo import MongoClient

## Establish connection

In [2]:
connection = MongoClient('localhost', 27017)
db = connection.Employee #dtabase name

## Print all collection name/table name

In [3]:
db.list_collection_names(include_system_collections=False)

['mydata', 'empdata']

## Select any one collection/table to show data and Print each individual record

In [4]:
data = db.empdata #table nme / collection name
EmployeeList = data.find()

In [5]:
for item in EmployeeList:
    print(item)

{'_id': ObjectId('60ec30db293b5702d9473b0f'), 'Name': 'Harihar', 'Age': 12.0}
{'_id': ObjectId('60ec3177293b5702d9473b10'), 'Name': 'Harihar', 'Age': 32.0}
{'_id': ObjectId('60ec317d293b5702d9473b11'), 'Name': 'Harihar', 'Age': 62.0}
{'_id': ObjectId('60ec3186293b5702d9473b12'), 'Name': 'Harihdd', 'Age': 62.0}

## Create a dataframe to give structure to the NoSQL data

In [6]:
import pandas as pd
df = pd.DataFrame(list(data.find()))

In [7]:
df

                        _id     Name   Age
0  60ec30db293b5702d9473b0f  Harihar  12.0
1  60ec3177293b5702d9473b10  Harihar  32.0
2  60ec317d293b5702d9473b11  Harihar  62.0
3  60ec3186293b5702d9473b12  Harihdd  62.0